
package com.quotorcloud.quotor.common.core.constant;

/**
 */
public interface CommonConstants {
//	---------------------------------------------------------------------
//	---------------------------------------------------------------------
//	----------------------------------考勤状态---------------------------

	String ATT_WORK_OVERTIME = "加班";
	String ATT_BE_LATE = "迟到";
	String ATT_LEAVE_EARLY = "早退";
	String ATT_NORMAL = "正常";
	String ATT_LACK_ATTENDANCE = "缺卡";
	String ATT_BE_LATE_WORK_OVERTIME = "加班，迟到";
	String ATT_BE_LATE_LEAVE_EARLY = "迟到，早退";
//	---------------------------------------------------------------------
//	---------------------------------------------------------------------
//	----------------------------------预约状态---------------------------
	/**
	 * 待确认
	 */
	Integer APPOINT_UNCONFIRMED = 1;

	/**
	 * 生效中
	 */
	Integer APPOINT_ACTIVE = 2;

	/**
	 * 已完成
	 */
	Integer APPOINT_COMPLETE = 3;

	/**
	 * 失效
	 */
	Integer APPOINT_LOSE_EFFICACY = 4;

//	---------------------------------------------------------------------
//	---------------------------------------------------------------------
//	----------------------------------是否是新客---------------------------

	/**
	 * 是
	 */
	Integer IS_NEW_MEMBER = 1;

	/**
	 * 不是
	 */
	Integer NOT_NEW_MEMBER = 2;

//	---------------------------------------------------------------------
//	---------------------------------------------------------------------
//	----------------------------------是否是会员---------------------------

	/**
	 * 是
	 */
	Integer IS_MEMBER = 1;

	/**
	 * 否
	 */
	Integer NOT_MEMBER = 2;

//	---------------------------------------------------------------------
//	---------------------------------------------------------------------
//	----------------------------------卡模板类型---------------------------



	/**
	 * 折扣
	 */
	Integer CARD_TYPE_DISCOUNT = 1;

	/**
	 * 金额
	 */
	Integer CARD_TYPE_MONEY = 2;

	/**
	 * 总次
	 */
	Integer CARD_TYPE_TOTAL = 2;

	/**
	 * 分次
	 */
	Integer CARD_TYPE_GRADATION = 4;

//	----------------------------------------------------------------------
//	----------------------------------------------------------------------
//	----------------------------------------------------------------------

	/**
	 * 卡内容
	 */
	Integer CONDITION_CARD_CONTENT = 1;

	/**
	 * 购卡赠送
	 */
	Integer CONDITION_BUY_CARD_GIVE = 2;

	/**
	 * 充值赠送
	 */
	Integer CONDITION_TOPUP_GIVE = 3;

//	----------------------------------------------------------------------
//	----------------------------------------------------------------------
//	----------------------------------------------------------------------
	/**
	 * 项目类别
	 */
	Integer CONDITION_PROJECT = 1;

	/**
	 * 产品类别
	 */
	Integer CONDITION_PRODUCT = 2;

	/**
	 *套餐
	 */
	Integer CONDITION_SET_MEAL = 3;


//	------------------------------------------------------------------
//	------------------------------------------------------------------
//	------------------------------------------------------------------

	/**
	 * 卡片
	 */
	Integer CONDITION_CARD = 4;

	/**
	 * 劵
	 */
	Integer CONDITION_DISCOUNTS = 5;

//	------------------------------------------------------------------
//	------------------------------------------------------------------
//	------------------------------------------------------------------

	/**
	 * 微信扫码
	 */
	Integer NATIVE = 1;

	/**
	 * 支付宝扫码
	 */
	Integer ZFB_CODE_PAY = 2;

	/**
	 * 小程序
	 */
	Integer JSAPI =3;

//	-------------------------------------------------------------------
//	-------------------------------------------------------------------
//	-------------------------------------------------------------------

	/**
	 * 未支付
	 */
	Integer NOT_PAY = 2;

	/**
	 * 已支付
	 */
	Integer PAY = 1;


//	-------------------------------------------------------------------
//	-------------------------------------------------------------------
//	-------------------------订单状态------------------------------

	/**
	 * 已完成
	 */
	Integer COMPLETED = 1;

	/**
	 * 待付款
	 */
	Integer WAIT_PAY = 2;

	/**
	 * 待评价
	 */
	Integer WAIT_EVALUATE = 3;

	/**
	 * 已关闭
	 */
	Integer CLOSE = 4;
//	-------------------------------------------------------------------
//	-------------------------------------------------------------------
//	-------------------------------------------------------------------


	/**
	 * 招聘
	 */
	Integer INVITE = 1;

	/**
	 * 求职
	 */
	Integer INN = 2;

	/**
	 * 入库
	 */
	Integer IN_INVENTORY =1;

	/**
	 * 出库
	 */
	Integer OUT_INVENTORY = 2;

	/**
	 * 发布
	 */
	Integer ISSUE = 1;

	/**
	 * 待发布
	 */
	Integer AWAIT_ISSUE = 2;

	/**
	 * 下架
	 */
	Integer SOLD_OUT = 3;

	/**
	 * 删除
	 */
	Integer STATUS_DEL = 1;
	/**
	 * 正常
	 */
	Integer STATUS_NORMAL = 0;

	/**
	 * 在职
	 */
	Integer STATUS_IN_JOB = 1;

	/**
	 * 离职
	 */
	Integer STATUS_OUT_JOB = 2;

	/**
	 * 男
	 */
	Integer STATUS_MAN = 1;

	/**
	 * 女
	 */
	Integer STATUS_WOMAN = 0;

	/**
	 * 分隔符
	 */
	String SEPARATOR = ",";

	/**
	 * 锁定
	 */
	String STATUS_LOCK = "9";

	/**
	 * 菜单
	 */
	String MENU = "0";

	/**
	 * 编码
	 */
	String UTF8 = "UTF-8";

	/**
	 * JSON 资源
	 */
	String CONTENT_TYPE = "application/json; charset=utf-8";

	/**
	 * 前端工程名
	 */
	String FRONT_END_PROJECT = "quotor-ui";

	/**
	 * 后端工程名
	 */
	String BACK_END_PROJECT = "quotor";

	/**
	 * 成功标记
	 */
	Integer SUCCESS = 0;
	/**
	 * 失败标记
	 */
	Integer FAIL = 1;

	/**
	 * 验证码前缀
	 */
	String DEFAULT_CODE_KEY = "DEFAULT_CODE_KEY_";

	//验证码过期时间
	public static final Long PASS_TIME =  50000 * 60 *1000L;
}
